# 9. 데이터 선택(조건)
조건에 해당하는 데이터 선택

In [4]:
import pandas as pd
df = pd.read_excel("score.xlsx", index_col = "지원번호")
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85      Python
2번    정대만  북산고  184   40   35   50  55  25        Java
3번    송태섭  북산고  168   80   75   70  80  75  Javascript
4번    서태웅  북산고  187   40   60   70  75  80         NaN
5번    강백호  북산고  188   15   20   10  35  10         NaN
6번    변덕규  능남고  202   80  100   95  85  80           C
7번    황태산  능남고  188   55   65   46  40  35      Python
8번    윤대협  능남고  190  100   85   90  95  95          C#

In [5]:
# 조건을 이용해 데이터가 조건에 맞는지 확인할 수 있다.
# 키가 185이상 여부 확인
df["키"] >= 185

지원번호
1번     True
2번    False
3번    False
4번     True
5번     True
6번     True
7번     True
8번     True
Name: 키, dtype: bool

In [6]:
filt = (df["키"]>=185)
df[filt]
#원하는 조건으로 뽑기

       이름   학교    키   국어   영어   수학  과학  사회    SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85  Python
4번    서태웅  북산고  187   40   60   70  75  80     NaN
5번    강백호  북산고  188   15   20   10  35  10     NaN
6번    변덕규  능남고  202   80  100   95  85  80       C
7번    황태산  능남고  188   55   65   46  40  35  Python
8번    윤대협  능남고  190  100   85   90  95  95      C#

In [10]:
df[-filt]
#filt 역으로 계산 즉 185미만

       이름   학교    키  국어  영어  수학  과학  사회        SW특기
지원번호
2번    정대만  북산고  184  40  35  50  55  25        Java
3번    송태섭  북산고  168  80  75  70  80  75  Javascript

In [12]:
df[df["키"]>=185] #조건을 직접 넣어 사용도 가능

       이름   학교    키   국어   영어   수학  과학  사회    SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85  Python
4번    서태웅  북산고  187   40   60   70  75  80     NaN
5번    강백호  북산고  188   15   20   10  35  10     NaN
6번    변덕규  능남고  202   80  100   95  85  80       C
7번    황태산  능남고  188   55   65   46  40  35  Python
8번    윤대협  능남고  190  100   85   90  95  95      C#

In [13]:
df.loc[df["키"]>=185,"수학"]
#키가 185이상인 데이터의 수학점수

지원번호
1번    100
4번     70
5번     10
6번     95
7번     46
8번     90
Name: 수학, dtype: int64

In [16]:
df.loc[df["키"]>=185, ["이름","수학","과학"]]
#키가 185이상인 사람들의  이름, 수학 ,과학값 추출

       이름   수학  과학
지원번호
1번    채치수  100  95
4번    서태웅   70  75
5번    강백호   10  35
6번    변덕규   95  85
7번    황태산   46  40
8번    윤대협   90  95

## 다양한 조건

### & 그리고

In [20]:
df.loc[(df["키"] >= 185) & (df["학교"]== "북산고")]

#키가 185 이상인 북산고 학생 데이터

       이름   학교    키  국어  영어   수학  과학  사회    SW특기
지원번호
1번    채치수  북산고  197  90  85  100  95  85  Python
4번    서태웅  북산고  187  40  60   70  75  80     NaN
5번    강백호  북산고  188  15  20   10  35  10     NaN

### | 또는

In [21]:
df.loc[(df["키"]<=170)|(df["키"]>=200)]

       이름   학교    키  국어   영어  수학  과학  사회        SW특기
지원번호
3번    송태섭  북산고  168  80   75  70  80  75  Javascript
6번    변덕규  능남고  202  80  100  95  85  80           C

### str 함수

In [25]:
filt =df["이름"].str.startswith("송")
df[filt]
# "송" 씨성을 가진 사람

       이름   학교    키  국어  영어  수학  과학  사회        SW특기
지원번호
3번    송태섭  북산고  168  80  75  70  80  75  Javascript

In [28]:
filt = df["이름"].str.contains("태")
df[filt]

#태 라는 글자가 들어간 사람 조건

       이름   학교    키  국어  영어  수학  과학  사회        SW특기
지원번호
3번    송태섭  북산고  168  80  75  70  80  75  Javascript
4번    서태웅  북산고  187  40  60  70  75  80         NaN
7번    황태산  능남고  188  55  65  46  40  35      Python

In [30]:
df[-filt] #이름에 "태"가 즐어가는 사람을 제외

       이름   학교    키   국어   영어   수학  과학  사회    SW특기
지원번호
1번    채치수  북산고  197   90   85  100  95  85  Python
2번    정대만  북산고  184   40   35   50  55  25    Java
5번    강백호  북산고  188   15   20   10  35  10     NaN
6번    변덕규  능남고  202   80  100   95  85  80       C
8번    윤대협  능남고  190  100   85   90  95  95      C#

In [33]:
langs =["Python","Java"]
filt=df["SW특기"].isin(langs)
df[filt]
# SW특기가 python이거나 Java인 사람.

       이름   학교    키  국어  영어   수학  과학  사회    SW특기
지원번호
1번    채치수  북산고  197  90  85  100  95  85  Python
2번    정대만  북산고  184  40  35   50  55  25    Java
7번    황태산  능남고  188  55  65   46  40  35  Python

In [36]:
langs =["python","java"]
filt = df["SW특기"].str.lower().isin(langs)
df[filt]
#SW특기 내부의 값을 소문자로 낮추어 확인한다.

       이름   학교    키  국어  영어   수학  과학  사회    SW특기
지원번호
1번    채치수  북산고  197  90  85  100  95  85  Python
2번    정대만  북산고  184  40  35   50  55  25    Java
7번    황태산  능남고  188  55  65   46  40  35  Python

In [39]:
filt = df["SW특기"].str.contains("Java", na =True)
df[filt] # true인것은 보여주고, 아닌것은 안보인것.
#Java라는 것을 포함한 애들 부르기
#오류가 뜨는 이유는 NaN 데이터가 있기에 

# na= True #NaN데이터에 대해서 True로 설정
# na= False #NaN데이터에 대해서 False로 설정

       이름   학교    키  국어  영어  수학  과학  사회        SW특기
지원번호
2번    정대만  북산고  184  40  35  50  55  25        Java
3번    송태섭  북산고  168  80  75  70  80  75  Javascript
4번    서태웅  북산고  187  40  60  70  75  80         NaN
5번    강백호  북산고  188  15  20  10  35  10         NaN

In [41]:
filt =df['SW특기'].str.contains("Java", na =False)
df[filt]

       이름   학교    키  국어  영어  수학  과학  사회        SW특기
지원번호
2번    정대만  북산고  184  40  35  50  55  25        Java
3번    송태섭  북산고  168  80  75  70  80  75  Javascript